import { Contents } from "@/types/books";

export const contents: Contents[] = [
    {
        id: 1,
        category: "រឿងអក្សរសិល្ប៍",
        thumbnail: "/ko-li-korm-nen.jpg",
        title: "រឿង គូលីកំនែន",
        publisher: {
            name: "លាត សុផាត",
            avatar: "https://github.com/pphatdev.png",
            date: "02/09/2021 12:00:00"
        },
        info: {
            authors: ["អ៊ឹម ថុក",],
            date: "ខែសីហា ១៩៥៦",
            storyType: "អក្សរសិល្ប៍ទំនើបដែលមានទស្សនៈជឿនលឿន និងមាននិន្នាការទៅខាងលទ្ធិសង្គមនិយម។",
            storySource: "រឿងគូលីកំណែនជាប្រលោមលោកបែបមនោគមវិជ្ជា ឆ្លុះបញ្ចាំងពីតថភាព​សង្គមកម្ពុជា ក្រោមនឹមអាណានិគមនិយម។",
            storyMovement: "ខេមរនិយម ព្រោះបានបង្ហាញពីជីវភាពពិតៗក្នុងសង្គមខ្មែរក្នុងកាលៈទេសៈដែល​ត្រូវបរទេសត្រួតត្រា។",
            atmosphericSociety: "ដំណើររឿងបានប្រព្រឹត្តទៅចាប់ពីរជ្ជកាលព្រះបាទស៊ីសុវត្ថិមុនីវង្ស (ពីឆ្នាំ​ ១៩២៧ ដល់ ១៩៤២) សម័យនោះប្រទេសកម្ពុជាឋិតក្រោមអាណានិគមបារាំង ជប៉ុន។",
        },
        slug: "/books?id=1&title=រឿង-គូលីកំនែន",
        views: 128
    },
    {
        id: 2,
        category: "រឿងអក្សរសិល្ប៍",
        thumbnail: "/mea-yerng.png",
        title: "រឿង មាយើង",
        publisher: {
            name: "លាត សុផាត",
            avatar: "https://github.com/pphatdev.png",
            date: "02/09/2021 12:00:00"
        },
        info: {
            authors: ["មិនស្គាល់ឈ្មោះ",],
            date: "មិនច្បាស់លាស់",
            storyType: "អក្សរសិល្ប៍ប្រជាប្រិយ",
            storySource: "ដំណើររឿងកើតឡើងនៅប្រទេសកម្ពុជា",
            storyMovement: "អក្សរសិល្ប៍ខេមរនិយម",
            atmosphericSociety: "ដំណើររឿងបានប្រព្រឹត្តទៅចាប់ពីរជ្ជកាលព្រះបាទស៊ីសុវត្ថិមុនីវង្ស (ពីឆ្នាំ​ ១៩២៧ ដល់ ១៩៤២) សម័យនោះប្រទេសកម្ពុជាឋិតក្រោមអាណានិគមបារាំង ជប៉ុន។",
        },
        slug: "/books?id=2&title=រឿង-មាយើង",
        views: 128
    },
    {
        id: 3,
        category: "រឿងអក្សរសិល្ប៍",
        thumbnail: "/preah-vesandor.jpg",
        title: "រឿង ព្រះវេស្សន្តរ",
        publisher: {
            name: "លាត សុផាត",
            avatar: "https://github.com/pphatdev.png",
            date: "02/09/2021 12:00:00"
        },
        info: {
            authors: ["សព្វថ្ងៃឯកសារគោលដែលយកមកសិក្សាគឺជាស្នាដៃរបស់បណ្ឌិតមហាឈឹម សុមន៍",],
            date: "គម្ពីរដើមជាស្នាដៃនៃព្រះអដ្ឋកឋាចារ្យដែលសរសេរជាភាសាបាលីមាននៅក្នុងគម្ពីរព្រះត្រៃបិដក។ ឯគម្ពីរជាភាសាសម្រាយដែលមាននៅក្នុងកម្ពុជរដ្ឋយើងគឺមានច្រើនប្រភេទណាស់។ ",
            storyType: "អក្សរសិល្ប៍បុរាណ, សាស្រ្តាទេសន៍",
            storySource: "រឿងគូលីកំណែនជាប្រលោមលោកបែបមនោគមវិជ្ជា ឆ្លុះបញ្ចាំងពីតថភាព​សង្គមកម្ពុជា ក្រោមនឹមអាណានិគមនិយមពីរ គឺបារាំង និងជប៉ុនដែលជារឿងមួយមានប្រភព​នៅក្នុងប្រទេសកម្ពុជាយើង ពីព្រោះដំណើររឿងបានប្រព្រឹត្តទៅនៅក្នុងឃុំគោកចំបក់ ស្រុក​កណ្តាលស្ទឹង ខេត្តកណ្តាល។",
            storyMovement: "អក្សរសិល្ប៍ពុទ្ធនិយម",
            atmosphericSociety: "ដំណើររឿងបានប្រព្រឹត្តទៅចាប់ពីរជ្ជកាលព្រះបាទស៊ីសុវត្ថិមុនីវង្ស (ពីឆ្នាំ​ ១៩២៧ ដល់ ១៩៤២) សម័យនោះប្រទេសកម្ពុជាឋិតក្រោមអាណានិគមបារាំង ជប៉ុន។",
        },
        slug: "/books?id=3&title=រឿង-ព្រះវេស្សន្តរ",
        views: 128
    },
]
